examples/ws/BPEL/BpelRESTServiceCA/src/jbiasa/BpelRESTServiceCA.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="BpelRESTServiceCA"
             xmlns:tns="BpelRESTServiceCA" xmlns:ns="http://j2ee.netbeans.org/wsdl/BpelRESTService/src/CountryInfoRequestor" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <import namespace="http://j2ee.netbeans.org/wsdl/BpelRESTService/src/CountryInfoRequestor" location="../jbiServiceUnits/BpelRESTService/CountryInfoRequestor.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:CountryInfoRequestorPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="CountryInfoRequestorOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="BpelRESTServiceCA"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="BpelRESTServiceCA"/>
            </output>
        </operation>
    </binding>
    <service name="BpelRESTServiceCAService1">
        <port name="ServiceRequestor" binding="tns:casaBinding1">
            <soap:address location="http://localhost:${HttpDefaultPort}/BpelRESTServiceCAService1/casaPort1"/>
        </port>
    </service>
</definitions>
