examples/ws/BPEL/BpelRESTServiceCA/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bpel="BpelRESTServiceCA">
  <soapenv:Body>
    <bpel:CountryInfoRequestorOperation>
      <countryName>India</countryName>
    </bpel:CountryInfoRequestorOperation>
  </soapenv:Body>
</soapenv:Envelope>